import { createSlice } from "@reduxjs/toolkit";

export type productType = {
    id: number;
    name: string;
    garenty: number;
    keeperCount: number;
    price: number;
    score: number;
    sendPrivecy: string[];
    data: {
        [key: string]: string | number;
    };
    images: string[];
    desc: string;
};

const initialState: productType[] = [
    {
        id: 0,
        name: "پایه خنک کننده لپ تاپ ایکس پی-پروداکت مدل XP-F1425D ",
        garenty: 18,
        keeperCount: 1,
        price: 2600,
        score: 4.5,
        sendPrivecy: [
            "ارسال از انباری تهران : ۱ الی ۲ روز کاری",
            "ارسالی از نبار اصفحان : تحویل فوری",
        ],
        data: {
            ابعاد: "۱۷ اینچ",
            وزن: "۸۰۰ گرم",
            "جنس بدنه": "پلاستیک و فلز",
            "نوع سیستم خنک کننده": "بادی",
            "تعداد فن": 1,
        },
        images: [],
        desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
        id: 0,
        name: "پایه خنک کننده لپ تاپ ایکس پی-پروداکت مدل XP-F1425D ",
        garenty: 18,
        keeperCount: 1,
        price: 2600,
        score: 4.5,
        sendPrivecy: [
            "ارسال از انباری تهران : ۱ الی ۲ روز کاری",
            "ارسالی از نبار اصفحان : تحویل فوری",
        ],
        data: {
            ابعاد: "۱۷ اینچ",
            وزن: "۸۰۰ گرم",
            "جنس بدنه": "پلاستیک و فلز",
            "نوع سیستم خنک کننده": "بادی",
            "تعداد فن": 1,
        },
        images: [],
        desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
        id: 0,
        name: "پایه خنک کننده لپ تاپ ایکس پی-پروداکت مدل XP-F1425D ",
        garenty: 18,
        keeperCount: 1,
        price: 2600,
        score: 4.5,
        sendPrivecy: [
            "ارسال از انباری تهران : ۱ الی ۲ روز کاری",
            "ارسالی از نبار اصفحان : تحویل فوری",
        ],
        data: {
            ابعاد: "۱۷ اینچ",
            وزن: "۸۰۰ گرم",
            "جنس بدنه": "پلاستیک و فلز",
            "نوع سیستم خنک کننده": "بادی",
            "تعداد فن": 1,
        },
        images: [],
        desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
        id: 0,
        name: "پایه خنک کننده لپ تاپ ایکس پی-پروداکت مدل XP-F1425D ",
        garenty: 18,
        keeperCount: 1,
        price: 2600,
        score: 4.5,
        sendPrivecy: [
            "ارسال از انباری تهران : ۱ الی ۲ روز کاری",
            "ارسالی از نبار اصفحان : تحویل فوری",
        ],
        data: {
            ابعاد: "۱۷ اینچ",
            وزن: "۸۰۰ گرم",
            "جنس بدنه": "پلاستیک و فلز",
            "نوع سیستم خنک کننده": "بادی",
            "تعداد فن": 1,
        },
        images: [],
        desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
        id: 0,
        name: "پایه خنک کننده لپ تاپ ایکس پی-پروداکت مدل XP-F1425D ",
        garenty: 18,
        keeperCount: 1,
        price: 2600,
        score: 4.5,
        sendPrivecy: [
            "ارسال از انباری تهران : ۱ الی ۲ روز کاری",
            "ارسالی از نبار اصفحان : تحویل فوری",
        ],
        data: {
            ابعاد: "۱۷ اینچ",
            وزن: "۸۰۰ گرم",
            "جنس بدنه": "پلاستیک و فلز",
            "نوع سیستم خنک کننده": "بادی",
            "تعداد فن": 1,
        },
        images: [],
        desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
];

const productSlice = createSlice({
    name: "productSlice",
    initialState,
    reducers: {},
});

export default productSlice.reducer;
